[{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "08 31, 2010", "reviewerID": "A3NSN9WOX8470M", "asin": "0006564224", "reviewerName": "mmm", "reviewText": "I don't use these for their original use, and in 1988 I purchased 2 and have needed replacements for the last year.  I never even thought of using the Internet to find new ones but to my pleasant surprise I found them immediately and actually paid LESS for them than I did in 1988!", "summary": "Many uses...", "unixReviewTime": 1283212800},
{"overall": 5.0, "vote": "2", "verified": true, "reviewTime": "04 2, 2010", "reviewerID": "A2AMX0AJ2BUDNV", "asin": "0006564224", "reviewerName": "John R. Welch", "reviewText": "Seems a bit expensive for a plastic bottle, but I couldn't find better value on the Internet. Product performs as advertised. Very fast response from this supplier.", "summary": "Dispenser bottle", "unixReviewTime": 1270166400},
{"overall": 5.0, "verified": true, "reviewTime": "11 5, 2015", "reviewerID": "A8LUWTIPU9CZB", "asin": "0560467893", "reviewerName": "Linda Fahner", "reviewText": "Great product, love it!!", "summary": "Five Stars", "unixReviewTime": 1446681600},
{"overall": 4.0, "vote": "4", "verified": true, "reviewTime": "10 29, 2015", "reviewerID": "AABKIIHAL0L66", "asin": "0560467893", "reviewerName": "TheBlueChain", "reviewText": "This is a sturdy floating corner shelf!  We mounted a TV on the wall in the corner of the room and needed a shelf for the cable box. This product is perfect for our needs! We had to cut down the rear corner for the wires to run up the wall behind this shelf, but that wasn't an issue with the product itself. It looks great!  I'm giving it 4 stars because the enclosed instructions weren't very helpful at all. Thankfully my husband is good at handyman type things, so he was able to figure it out.", "summary": "Sturdy Shelf, Poor Installation Instructions", "unixReviewTime": 1446076800},
{"overall": 3.0, "verified": true, "reviewTime": "09 9, 2015", "reviewerID": "A3DA0KIQ5OBK5C", "asin": "0560467893", "reviewerName": "angelaarden", "reviewText": "I purchased 4 of these shelves. they look great. Thought they were wood. I guess I didn't read thoroughly. Anyway, that didn't matter to me, as they look real nice and were the size I was looking for. I gave them 3 stars as one of my shelves is coming apart at one end. I have used these less than 4 months. They all have way less than 30 lbs on them. It may be a minor issue and just a bad one as the others are great - no issues. My husband is going to try and glue and clamp it.", "summary": "Look great - one bad one...", "unixReviewTime": 1441756800},
{"overall": 1.0, "verified": true, "reviewTime": "08 23, 2015", "reviewerID": "A32IGEYSCMEMOD", "asin": "0560467893", "reviewerName": "love", "reviewText": "I truly wanted to like this item.  It fell apart while I was installing it with a screwdriver.", "summary": "One Star", "unixReviewTime": 1440288000},
{"overall": 3.0, "vote": "2", "verified": true, "reviewTime": "05 7, 2015", "reviewerID": "A3B6GKQQ1JJ167", "asin": "0560467893", "reviewerName": "Harry Slaughter", "reviewText": "Pretty flimsy, but does the job. If your corner is not square and flat, the shelves will probably not end up level. These shelves should probably be going for half the price.", "summary": "Meh", "unixReviewTime": 1430956800},
{"overall": 3.0, "vote": "9", "verified": true, "reviewTime": "12 31, 2014", "reviewerID": "A2OEROVWM53QR7", "asin": "0560467893", "reviewerName": "Ken", "reviewText": "Note, the way this shelf mounts to the wall is nothing like the instructions say. it's not very difficult to figure out, but it's a completely different mounting system than the picture.", "summary": "mounting instructions need to be updated", "unixReviewTime": 1419984000},
{"overall": 5.0, "vote": "3", "verified": true, "reviewTime": "12 15, 2014", "reviewerID": "A3VKOWFHJUAAHE", "asin": "0560467893", "reviewerName": "Trayson H.", "reviewText": "It's a shelf.  it was inexpensive and holds a 19\" flatscreen TV without exposed braces.", "summary": "It's a shelf. it was inexpensive and holds a ...", "unixReviewTime": 1418601600},
{"overall": 2.0, "vote": "2", "verified": true, "reviewTime": "12 5, 2014", "reviewerID": "A19CYDS573LII9", "asin": "0560467893", "reviewerName": "Carolyn C Cook", "reviewText": "Instructions are wrong and it is not very sturdy.", "summary": "Two Stars", "unixReviewTime": 1417737600},
{"overall": 5.0, "vote": "3", "verified": false, "reviewTime": "01 23, 2010", "reviewerID": "A3T2DUQAOSS5JW", "asin": "0681795107", "reviewerName": "S. Scales", "reviewText": "This mug comes in a variety of colors most of which are hard to find on Amazon, easy to find on the seller's website but not easy to order. It's worth the effort of figuring out how to place the order though, as this mug keeps tea hot for a good couple of hours, and even longer if left in a sunny car. I have tried a variety of different travel mugs of similar size and this one is by far the best for not retaining the flavor of the previous cup of tea thanks to its metal instead of plastic interior. Additionally it is better designed, fitting nicely in the car cup-holder and having a flat lid that doesn't poke your nose every time you take a sip, and allows you to close the hole in the lid by sliding the cover with your teeth so you don't have to take both hands off the wheel while driving. The only minor quibble is that the sliding cover is a little hard to clean underneath (by hand, we don't use a dish-washer for anything) - this is not a problem for black or fruit teas, but if you take milk, a gunge can build up once in a while. Timolino addressed this problem in their version 2.0 mug by making the cover un-clippable for easier washing, but unfortunately also modified the rest of the lid so that now it has a big lip like other mugs, making it hard to sip, and also added more weight to the top of the mug with unnecessary extra plastic and a thicker handle. The best would be to revert to this version 1.0 mug and just make the sliding cover un-clippable.", "summary": "Best travel mug ever", "unixReviewTime": 1264204800},
{"overall": 5.0, "vote": "8", "verified": false, "reviewTime": "01 23, 2010", "reviewerID": "A3T2DUQAOSS5JW", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "S. Scales", "reviewText": "This mug comes in a variety of colors most of which are hard to find on Amazon, easy to find on the seller's website but not easy to order. It's worth the effort of figuring out how to place the order though, as this mug keeps tea hot for a good couple of hours, and even longer if left in a sunny car. I have tried a variety of different travel mugs of similar size and this one is by far the best for not retaining the flavor of the previous cup of tea thanks to its metal instead of plastic interior. Additionally it is better designed, fitting nicely in the car cup-holder and having a flat lid that doesn't poke your nose every time you take a sip, and allows you to close the hole in the lid by sliding the cover with your teeth so you don't have to take both hands off the wheel while driving. The only minor quibble is that the sliding cover is a little hard to clean underneath - this is not a problem for black or fruit teas, but if you take milk, a gunge can build up once in a while. Timolino addressed this problem in their version 2.0 mug by making the cover un-clippable for easier washing, but unfortunately also modified the rest of the lid so that now it has a big lip like other mugs, making it hard to sip, and also added more weight to the top of the mug with unnecessary extra plastic and a thicker handle. The best would be to revert to this version 1.0 mug and just make the sliding cover un-clippable.", "summary": "Best travel mug ever", "unixReviewTime": 1264204800},
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "09 20, 2009", "reviewerID": "AV24U7RX2TX2X", "asin": "0681795107", "reviewerName": "Eden A. Millecchi", "reviewText": "This is hands down the best travel mug I have used. It goes with me every day and is a joy to use while driving. The caps seals tightly to the cup, the clip covering the opening slides easily and the handle is just the right angle for tipping to drink. It requires the absolute minimal distraction from my attention to the road.\n\nI only wish it was dishwasher safe, but none of the others I've tried were either, so I've given up on that. Also the clip in the lid is removeable so you can clean any coffee residue out from under it. I don't think replacement clips are available for sale, but that would be the only other improvement I can think of.", "summary": "this mug rocks", "unixReviewTime": 1253404800},
{"overall": 5.0, "verified": true, "reviewTime": "10 10, 2014", "reviewerID": "A2UQSEHHIUKYXS", "asin": "0681795107", "style": {"Color:": " Black"}, "reviewerName": "pal", "reviewText": "Great coffee mug.", "summary": "Five Stars", "unixReviewTime": 1412899200},
{"overall": 3.0, "verified": true, "reviewTime": "07 28, 2014", "reviewerID": "A1CQEO4BCUNTNW", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Uncle Al Everyone&#039;s Pal", "reviewText": "CAN'T BEP[UT IN DISHWASHER  LEAKS WHEN IT FALLS FROM VERTICAL TO HORIZONTAL\nPOSITION.  ONLY KEEPS OPTIMAL TEMPERATURE FOR LESS THAN FIFTEEN MINUTES\nSHODDY CHINESE FABRICATION.  RELIED ON ADVICE FROM AMERICAN TEST KITCHEN\nTHEY SURE WERE WRONG OR I HAVE THE WRONG UNIT.", "summary": "CAN'T BEP[UT IN DISHWASHER LEAKS WHEN IT FALLS FROM VERTICAL ...", "unixReviewTime": 1406505600},
{"overall": 4.0, "verified": true, "reviewTime": "06 11, 2014", "reviewerID": "A3MQNM6NOG0HCX", "asin": "0681795107", "style": {"Color:": " Black"}, "reviewerName": "Dave", "reviewText": "Been using this model of insulated mugs for years. It's a tank that can be dropped and be no worse for wear. Meets my needs but wish it would keep coffee hot longer that 45 minutes.", "summary": "Works for me", "unixReviewTime": 1402444800},
{"overall": 5.0, "verified": true, "reviewTime": "04 1, 2014", "reviewerID": "A1Q99NP69KSR2Q", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Carole C. Mayo", "reviewText": "This mug is a great size, keeps chai tea hot and is a good investment.  Great gift, which I have provided for others.", "summary": "Great mug", "unixReviewTime": 1396310400},
{"overall": 5.0, "verified": true, "reviewTime": "01 22, 2014", "reviewerID": "A3MCTN65BU7XRA", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "luckyg", "reviewText": "So much better than plastic mug types--keeps coffee warm and doesn't stain. We bought it because Cook's Country rated it tops.", "summary": "Recommend", "unixReviewTime": 1390348800},
{"overall": 1.0, "verified": true, "reviewTime": "10 30, 2013", "reviewerID": "A7JVZFSXVY9RL", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Nickleen", "reviewText": "I like my coffee hot; borderline scorching but drinkable.  About 10 years ago I purchased several Avantro coffee mugs that are very similar to these.  Those have been able to keep my coffee at my preferred drinking temperature for well over 4 hours even on the coldest of days.  I work outside so hot coffee is crucial in these nasty New England winters.\nWell, day one with this new mug and I am quite disappointed.  This mug barely kept my coffee warm for an hour.  That is quite unacceptable seeing as how this company is the one that bought out Avantro.", "summary": "Not keeping coffee hot for long enough", "unixReviewTime": 1383091200},
{"overall": 1.0, "verified": true, "reviewTime": "09 20, 2013", "reviewerID": "A2RQ7VLAK1SHPU", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "Lacemaker427", "reviewText": "This mug does only a fair job of keeping coffee hot.  It will absolutely NOT protect your shirt, pants, carseat, or anything else from spills and drips!  The lid does help to keep the coffee hot in that without the lid it is exposed to the air.  That slight benefit and it's attractive appearance are the only advantages I found.  If you have NO concern about leaking/dripping, this mug is sufficient, however, the Contigo Autoseal West Loop is a much better product, and for essentially the same price.  I have returned my Timolino PABLO-46GREmug and purchased 2 Contigo Autoseal West Loop thermal mugs in 2 of the many colors available (I like lilac & gunmetal).  This Timolino thermal mug, in my opinion, should cost only $10 due to it propensity to leak!", "summary": "Leaks like a waterfall when at an angle!", "unixReviewTime": 1379635200},
{"overall": 4.0, "verified": true, "reviewTime": "08 3, 2013", "reviewerID": "A2Y7ABSQZXPSJS", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "Mandy Bergman", "reviewText": "Comfortable to use for with temperature beverage and fits in all my car's tiny cup holders without tipping. Not dishwashing, though. Handwash only.", "summary": "really like", "unixReviewTime": 1375488000},
{"overall": 5.0, "verified": true, "reviewTime": "05 17, 2013", "reviewerID": "A1ACIEJU98KF3F", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Josh Dix", "reviewText": "This cup worked well. It is not entirely leak proof but was a good office cup especially if you were like me and drank your coffee within an hour or so. Simple stainless and worked.\n\nI think someone stole mine to be honest I don't know where it took off to.", "summary": "This cup", "unixReviewTime": 1368748800},
{"overall": 3.0, "vote": "3", "verified": true, "reviewTime": "05 17, 2013", "reviewerID": "A3LBVWKEMTISND", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "Hugh Stratford", "reviewText": "This cup keeps your drink cold or hot and fits the holder in my car, only down side is if it falls over it leaks and at 89 I am good at knocking any cup over.", "summary": "Drink up", "unixReviewTime": 1368748800},
{"overall": 4.0, "verified": true, "reviewTime": "03 22, 2013", "reviewerID": "A1CV69KIB30WW3", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "PhilaSanctuary", "reviewText": "right size, attractive, keeps it hot, fairly easy to clean though it has that little hole on the bottom that travel mugs always have allowing small amount of water to leak back into the cup. Saw it recommnended on American Test Kitchen, otherwise would not have purchased it.", "summary": "right size, keeps it hot", "unixReviewTime": 1363910400},
{"overall": 4.0, "verified": true, "reviewTime": "03 20, 2013", "reviewerID": "A3RMC04VRINS4W", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "cindy francis", "reviewText": "Have not used it often enough, but does what it is supposed to do, ie, keeps drinks hot AND does NOT leak. I am looking forward to giving these as gifts next Christmas", "summary": "Dependable", "unixReviewTime": 1363737600},
{"overall": 3.0, "verified": true, "reviewTime": "02 26, 2013", "reviewerID": "A9IWX56NDNJKS", "asin": "0681795107", "style": {"Color:": " Red"}, "reviewerName": "Patricia Hanley", "reviewText": "Convenient shape, good handle; but doesn't hold temperature as long as I would like on a long trip.  Good for short commute or errands around town.  Fits cupholder well.", "summary": "Timolino PAB-46GRE travel mug", "unixReviewTime": 1361836800},
{"overall": 5.0, "vote": "4", "verified": true, "reviewTime": "01 21, 2013", "reviewerID": "AVE60P73ELI2P", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "danielc74", "reviewText": "LOVE these cups! My husband has hand one for 10 years and it's still going strong. This particular purchase was so he'd have a cleaner, newer one. The only thing we suggest is hand washing. After it's been washed in the dishwasher it leaks water like crazy from the bottom.", "summary": "Travel Mug", "unixReviewTime": 1358726400},
{"overall": 3.0, "vote": "4", "verified": true, "reviewTime": "12 25, 2012", "reviewerID": "ADNDEQWSAIOSX", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "shopper 5757", "reviewText": "Convenient with a handle on the mug, keeps my coffee hot/warm for 2 -3 hrs, easy to wash and clean the lid -- these are expected from reading reviews.\nBut it leaks from the lid while walking with it in my hand -- major inconvenient.  Also, the mug feels hot when the coffee is hot.", "summary": "It leaks from the lid", "unixReviewTime": 1356393600},
{"overall": 5.0, "verified": true, "reviewTime": "04 6, 2012", "reviewerID": "AO84V2TFRX9OB", "asin": "0681795107", "style": {"Color:": " Brushed Stainless"}, "reviewerName": "Meddybempster", "reviewText": "These mugs do what they are designed to do, i.e., keep liquids hot or cold for hours, don't leak, easy to clean and attractive to look at.  But, do not put them in the dishwasher as they lose their magic!", "summary": "Keeps your drinks hot or cold for hours", "unixReviewTime": 1333670400}]
